const e={map:'[{"第一章基础语法":["0.0"],"字面量":["0.1"],"注释":["0.2"],"变量":["0.3"],"数据类型":["0.4"],"数据类型转换":["0.5"],"标识符":["0.6"],"运算符":["0.7"],"复合运算符":["0.8"],"字符串扩展":["0.9"],"字符串格式化":["0.10"],"字符串简写格式化":["0.11"],"字符串精度控制":["0.12"],"第二章控制语句":["0.13"],"判断语句":["0.14"],"第三章循环语句":["0.20"],"while循环的基础语法":["0.21"],"while循环的嵌套":["0.22"],"for循环的基础语法":["0.23"],"for循环的嵌套应用":["0.24"],"循环中断":["0.25"],"第四章函数":["0.26"],"函数介绍":["0.27"],"函数的定义":["0.28"],"函数的参数":["0.29"],"函数的返回值":["0.30"],"变量的作用域":["0.31"],"第五章面向对象":["0.32"],"初识对象":["0.33"],"成员方法":["0.34"],"类和对象":["0.35"],"类和对象的关系是什么":["0.36"],"其它内置方法":["0.37"],"str":["0.38"],"lt":["0.39"],"封装":["0.40"],"继承":["0.41"],"多继承":["0.42"],"复写以及调用":["0.43"],"多态":["0.44"],"抽象类":["0.45"],"ehr":["3.0"],"飞机大战":["4.0"],"面向对象":["4.1"],"西普大陆":["5.0"],"七夕之约":["5.1"],"工作证明":["6.0"],"国科":["6.2"],"index":["7.0"],"归一化处理":["8.0"],"simplenormalizechildren":["8.1"],"更多例子":["8.2","8.4"],"normalizearraychildren":["8.3"],"render":["9.0"],"array":["10.0"],"树形结构":["11.0"],"三层结构":["11.1"],"最终代码":["11.2"],"开发实践种的工具函数":["12.0"]},{"0":["8.3","11.0"],"1":["0.1","0.15","11.0"],"2":["0.1","0.16","11.0"],"3":["0.1","0.17","11.0"],"4":["0.18","11.0"],"5":["0.19","11.0"],"6":["11.0"],"1000":["11.0"],"1100":["11.0"],"1101":["11.0"],"1102":["11.0"],"1103":["11.0"],"1104":["11.0"],"1200":["11.0"],"1201":["11.0"],"1202":["11.0"],"1203":["11.0"],"1300":["11.0"],"1301":["11.0"],"1302":["11.0"],"1303":["11.0"],"1304":["11.0"],"1400":["11.0"],"1401":["11.0"],"1402":["11.0"],"1403":["11.0"],"1500":["11.0"],"1501":["11.0"],"1502":["11.0"],"1503":["11.0"],"2000":["11.0"],"2100":["11.0"],"2101":["11.0"],"2102":["11.0"],"2200":["11.0"],"4399":["6.1"],"500000":["0.31"],"学习目标":["0.1"],"掌握字面量的含义":["0.1"],"了解常见字面量类型":["0.1"],"基于print语句完成各类字面量输出":["0.1"],"在代码中":["0.1"],"被":["0.1"],"写下来的":["0.1"],"的":["0.1"],"固定的值":["0.1"],"type":["0.4"],"任何数据都可以转成字符串类型":["0.5"],"语句":["0.5"],"标识符命名规则":["0.6"],"描述":["0.7","0.8","0.15"],"实例":["0.7","0.8"],"加":["0.7"],"两个对象相加":["0.7"],"a":["0.7","0.8","8.2"],"运算符":["0.8","0.15"],"加法赋值运算符":["0.8"],"c":["0.8","8.3"],"格式符号":["0.10"],"image":["0.11","0.12","0.15","0.19","0.20","0.21","0.22","0.23","0.24","0.29","0.30","0.34","0.35","0.37","0.41","0.43","6.2"],"进行逻辑判断":["0.14"],"布尔类型和比较运算符":["0.15"],"20230507084238044":["0.15"],"20230507084312160":["0.15"],"示例":["0.15"],"判断语句的嵌套":["0.19"],"20230507084933070":["0.19"],"20230507084940271":["0.19"],"python":["0.19","0.22","0.24","0.31","0.35","0.37"],"import":["0.19"],"random":["0.19"],"20230507091141354":["0.22"],"20230507091622849":["0.24"],"break和continue":["0.25"],"函数":["0.27"],"是组织好的":["0.27"],"函数定义":["0.28"],"20230507103417340函数默认返回none":["0.30"],"变量作用域指的是变量的作用范围":["0.31"],"变量在哪里可用":["0.31"],"在哪里不可用":["0.31"],"主要分为两类":["0.31"],"局部变量和全局变量":["0.31"],"定义一个全局变量money":["0.31"],"money":["0.31"],"定义一个全局变量name":["0.31"],"name":["0.31","11.0"],"none":["0.31"],"input":["0.31"],"请输入您的姓名":["0.31"],"定义查询函数":["0.31"],"def":["0.31"],"设计表格":["0.33"],"20230507111358788":["0.35"],"20230507111404993":["0.35"],"class":["0.35","0.37"],"类是程序中的":["0.36"],"20230507111610421":["0.37"],"clock":["0.37"],"id":["0.37","11.0"],"期望把类对象转成字符串":["0.38"],"期望比较两个类的":["0.39"],"某个属性的值":["0.39"],"私有成员类对象是没办法直接使用的":["0.40"],"谁先来的":["0.42"],"顶层上级":["0.45"],"项目待整理":["3.0"],"在flash里打一些标签":["5.1"],"它的目的是保证":["8.0"],"js":["8.1","8.2","8.4","11.0","11.1","11.2"],"export":["8.1","11.0","11.1"],"function":["8.1","8.3","11.1"],"children":["8.1","8.3","8.4","11.0"],"any":["8.1","8.3"],"for":["8.1","8.3","11.1"],"let":["8.1","8.3","11.1","11.2"],"i":["8.1","8.3"],"const":["8.2","8.3","8.4","11.0","11.2"],"functionalcomponent":["8.2"],"functional":["8.2"],"true":["8.2"],"render":["8.2"],"h":["8.2","8.4"],"return":["8.2"],"h1":["8.2"],"this":["8.2","8.4"],"is":["8.2"],"ts":["8.3"],"nestedindex":["8.3"],"string":["8.3"],"array":["8.3"],"vnode":["8.3"],"res":["8.3"],"last":["8.3"],"length":["8.3","11.1"],"null":["8.4","11.0"],"hello":["8.4"],"span":["8.4"],"world":["8.4"],"div":["8.4"],"对数组结构的处理包括":["10.0"],"如下数据结构":["11.0"],"一个树形菜单一个选种后的所有checkedkeys":["11.0"],"我们需要做的是根据选中的checkedkeys过滤掉没选中的":["11.0"],"树形菜单":["11.0"],"treedata":["11.0","11.2"],"parentid":["11.0"],"weight":["11.0"],"权限管理":["11.0"],"path":["11.0"],"admin":["11.0"],"keepalive":["11.0"],"onlineflowentryid":["11.0"],"onlineformid":["11.0"],"sortorder":["11.0"],"icon":["11.0"],"quanxianguanli":["11.0"],"menutype":["11.0"],"permission":["11.0"],"label":["11.0"],"用户管理":["11.0"],"user":["11.0"],"index":["11.0"],"yonghuguanli":["11.0"],"用户新增":["11.0"],"sys":["11.0"],"add":["11.0"],"用户修改":["11.0"],"edit":["11.0"],"用户删除":["11.0"],"del":["11.0"],"导入导出":["11.0"],"菜单管理":["11.0"],"menu":["11.0"],"caidanguanli":["11.0"],"菜单新增":["11.0"],"菜单修改":["11.0"],"菜单删除":["11.0"],"角色管理":["11.0"],"role":["11.0"],"jiaoseguanli":["11.0"],"角色新增":["11.0"],"角色修改":["11.0"],"角色删除":["11.0"],"分配权限":["11.0"],"perm":["11.0"],"部门管理":["11.0"],"dept":["11.0"],"web":["11.0"],"部门新增":["11.0"],"部门修改":["11.0"],"部门删除":["11.0"],"租户管理":["11.0"],"tenant":["11.0"],"erji":["11.0"],"zuhushouye":["11.0"],"租户新增":["11.0"],"systenant":["11.0"],"租户修改":["11.0"],"租户删除":["11.0"],"系统管理":["11.0"],"system":["11.0"],"xitongpeizhi":["11.0"],"日志管理":["11.0"],"log":["11.0"],"rizhi":["11.0"],"日志删除":["11.0"],"字典管理":["11.0"],"dict":["11.0"],"navicon":["11.0"],"zdgl":["11.0"],"处理代码如下":["11.1"],"定义过滤函数":["11.1"],"filtertreebycheckkeys":["11.1"],"tree":["11.1"],"checkkeys":["11.1"],"判断checkkeys是否为空":["11.1"],"不为空才进入逻辑处理":["11.1"],"否则直接返回原始tree":["11.1"],"if":["11.1"],"遍历树形结构菜单":["11.1"],"定义一个过滤函数":["11.2"],"接受treedata和checkedkeys作为参数":["11.2"],"filtertree":["11.2"],"checkedkeys":["11.2"],"创建一个空数组":["11.2"],"用来存放过滤后的结果":["11.2"],"处理数据结构时用到的函数记录":["12.0"]},{"0":["8.1","11.1"],"1":["0.19","0.22","0.30","8.3"],"3":["0.15"],"7":["11.0"],"8":["11.0"],"9":["11.0"],"10":["0.19","11.0"],"11":["11.0"],"12":["11.0"],"30":["0.7"],"2201":["11.0"],"2202":["11.0"],"2203":["11.0"],"2210":["11.0"],"2211":["11.0"],"2212":["11.0"],"2213":["11.0"],"2400":["11.0"],"2401":["11.0"],"2402":["11.0"],"2403":["11.0"],"2500":["11.0"],"2501":["11.0"],"2502":["11.0"],"2503":["11.0"],"2600":["11.0"],"2601":["11.0"],"2700":["11.0"],"2800":["11.0"],"2810":["11.0"],"2820":["11.0"],"2830":["11.0"],"2840":["11.0"],"2850":["11.0"],"2860":["11.0"],"2870":["11.0"],"8000":["11.0"],"8001":["11.0"],"20210929":["6.1"],"称之为字面量":["0.1"],"类型":["0.1"],"描述":["0.1"],"说明":["0.1","0.5"],"数字":["0.1"],"number":["0.1"],"支持整数":["0.1"],"int":["0.1","0.19"],"浮点数":["0.1"],"float":["0.1"],"复数":["0.1"],"complex":["0.1"],"布尔":["0.1"],"在程序代码中对程序代码进行解释说明的文字":["0.2"],"作用":["0.2"],"在程序运行时":["0.3"],"被查看类型的数据":["0.4"],"函数":["0.5"],"python中":["0.6"],"b":["0.7","0.15"],"输出结果":["0.7"],"减":["0.7"],"得到负数或是一个数减去另一个数":["0.7"],"等效于":["0.8"],"减法赋值运算符":["0.8"],"转化":["0.10"],"s":["0.10"],"20230507083908008":["0.11"],"20230507083851981":["0.12"],"是生活中常见的行为":["0.14"],"判断内容是否相等":["0.15"],"满足为true":["0.15"],"不满足为false":["0.15"],"如a":["0.15"],"则":["0.15"],"a":["0.15","8.4"],"if语句的基本格式":["0.16"],"if":["0.17","0.18","0.31","8.1","8.3","11.2"],"num":["0.19"],"randint":["0.19"],"guess":["0.19"],"input":["0.19"],"20230507090741845":["0.20"],"20230507090909130":["0.21"],"i":["0.22","0.24","11.1"],"while":["0.22"],"20230507091337795":["0.23"],"for":["0.24","11.2"],"in":["0.24"],"在这个重复的过程中":["0.25"],"可重复使用的":["0.27"],"用来实现特定功能的代码段":["0.27"],"image":["0.28","0.38","0.39","0.45"],"20230507103237942":["0.29"],"什么是none":["0.30"],"none是类型":["0.30"],"query":["0.31"],"show":["0.31"],"header":["0.31"],"print":["0.31"],"查询余额":["0.31"],"f":["0.31"],"您好":["0.31"],"您的余额剩余":["0.31"],"元":["0.31"],"定义存款函数":["0.31"],"称之为":["0.33"],"设计类":["0.33"],"20230507110618318":["0.34"],"clock":["0.35"],"id":["0.35","11.1"],"none":["0.35","0.37"],"price":["0.35","0.37"],"def":["0.35","0.37"],"设计图纸":["0.36"],"init":["0.37"],"self":["0.37"],"20230507112303223":["0.39"],"是类内部的其它成员使用的":["0.40"],"20230507112805249":["0.41"],"谁的优先级要高":["0.42"],"20230507113439867":["0.43"],"指的是":["0.44"],"20230507114009025":["0.45"],"预计分版本记录":["3.0"],"西普大陆小游戏":["5.0"],"sprit":["5.1"],"等":["5.1"],"20230507073428517":["6.2"],"render":["8.0"],"length":["8.1"],"array":["8.1","8.2","8.4"],"isarray":["8.1","8.3"],"component":["8.2"],"p":["8.2","8.4"],"it":["8.2","8.4"],"returns":["8.2"],"an":["8.2"],"of":["8.2","11.2"],"vnodes":["8.2","8.4"],"假如渲染函数返回的不是一维数组":["8.2"],"而是这样的":["8.2"],"null":["8.3"],"typeof":["8.3"],"boolean":["8.3"],"continue":["8.3"],"nested":["8.3","8.4"],"push":["8.3"],"apply":["8.3"],"is":["8.4"],"contains":["8.4"],"two":["8.4"],"false":["8.4"],"tree":["10.0"],"字典删除":["11.0"],"字典新增":["11.0"],"字典修改":["11.0"],"文件管理":["11.0"],"file":["11.0"],"wenjianguanli":["11.0"],"删除文件":["11.0"],"参数管理":["11.0"],"param":["11.0"],"canshu":["11.0"],"参数新增":["11.0"],"syspublicparam":["11.0"],"参数删除":["11.0"],"参数编辑":["11.0"],"quartz管理":["11.0"],"daemon":["11.0"],"job":["11.0"],"manage":["11.0"],"guanwangfangwen":["11.0"],"任务新增":["11.0"],"任务修改":["11.0"],"任务删除":["11.0"],"任务暂停":["11.0"],"shutdown":["11.0"],"任务开始":["11.0"],"start":["11.0"],"任务刷新":["11.0"],"refresh":["11.0"],"执行任务":["11.0"],"run":["11.0"],"终端管理":["11.0"],"client":["11.0"],"bangzhushouji":["11.0"],"客户端新增":["11.0"],"客户端修改":["11.0"],"客户端删除":["11.0"],"密钥管理":["11.0"],"social":["11.0"],"miyue":["11.0"],"密钥新增":["11.0"],"details":["11.0"],"密钥修改":["11.0"],"密钥删除":["11.0"],"令牌管理":["11.0"],"token":["11.0"],"denglvlingpai":["11.0"],"令牌删除":["11.0"],"动态路由":["11.0"],"route":["11.0"],"获取当前节点":["11.1"],"node":["11.1","11.2"],"判断当前节点的id是否在checkkeys数组中":["11.1"],"includes":["11.1","11.2"],"result":["11.2"],"遍历treedata中的每个节点":["11.2"],"判断节点的id是否在checkedkeys中":["11.2"]},{"1":["0.6","0.24","0.27"],"9":["0.22"],"10":["0.1","0.7","0.24"],"13":["0.1"],"14":["0.1"],"127":["11.0"],"3000":["11.0"],"3100":["11.0"],"3101":["11.0"],"3110":["11.0"],"3200":["11.0"],"3300":["11.0"],"3400":["11.0"],"3500":["11.0"],"3600":["11.0"],"5001":["11.0"],"5020":["11.0"],"9999":["11.0"],"bool":["0.1"],"整数":["0.1"],"如":["0.1"],"注释不是程序":["0.2"],"能储存计算结果或能表示值的抽象概念":["0.3"],"int":["0.5"],"x":["0.5"],"标识符命名的规则主要有3类":["0.6"],"乘":["0.7"],"两个数相乘或是返回一个被重复若干次的字符串":["0.7"],"乘法赋值运算符":["0.8"],"将内容转换成字符串":["0.10"],"放入占位位置":["0.10"],"同样":["0.14"],"为":["0.15"],"true":["0.15"],"判断内容是否不相等":["0.15"],"python":["0.16"],"else":["0.17","0.19","8.3","11.1"],"elif":["0.18"],"请输入要猜测的数字":["0.19"],"if":["0.19"],"print":["0.19"],"恭喜":["0.19"],"第一次就猜中了":["0.19"],"while循环的注意事项":["0.21"],"定义内层循环的控制变量":["0.22"],"j":["0.22"],"for":["0.23"],"range":["0.24"],"会出现一些其它情况让我们不得不":["0.25"],"函数是":["0.27"],"20230507102929068":["0.28"],"nonetype":["0.30"],"的字面量":["0.30"],"用于表示":["0.30"],"saving":["0.31"],"num":["0.31"],"global":["0.31"],"存款":["0.31"],"您存款":["0.31"],"元成功了":["0.31"],"false":["0.31"],"定义取款函数":["0.31"],"class":["0.33"],"打印表格":["0.33"],"ring":["0.35"],"self":["0.35"],"import":["0.35"],"winsound":["0.35"],"beep":["0.35"],"对象是基于图纸生产的具体实体":["0.36"],"成员变量可以不写":["0.37"],"如果写了":["0.37"],"下面就相当于赋值":["0.37"],"如果不写相当于申明加赋值":["0.37"],"20230507112126667":["0.38"],"20230507112308015":["0.39"],"方法":["0.39"],"image":["0.40","0.42","5.1"],"20230507112604357":["0.40"],"多种状态":["0.44"],"即完成某个行为时":["0.44"],"20230507114021030":["0.45"],"近请期待":["3.0"],"西普大陆精灵大全":["5.0"],"20230507064012098":["5.1"],"092240":["6.1"],"函数返回的":["8.0"],"return":["8.1"],"prototype":["8.1"],"concat":["8.1"],"apply":["8.1"],"the":["8.2","8.4"],"parent":["8.2"],"h2":["8.2"],"first":["8.2"],"isprimitive":["8.3"],"text":["8.3"],"convert":["8.3"],"primitive":["8.3"],"to":["8.3"],"h1":["8.4"],"last":["8.4"],"vnode":["8.4"],"这个数组包含了各种类型的值":["8.4"],"如果你把它传递给":["8.4"],"normalizearraychildren":["8.4"],"函数":["8.4"],"它会返回一个只包含":["8.4"],"等结构后续会补充":["10.0"],"luyou":["11.0"],"1536370246466990081":["11.0"],"人事管理":["11.0"],"personnel":["11.0"],"1536370394706276353":["11.0"],"员工花名册":["11.0"],"staff":["11.0"],"1547388265310535682":["11.0"],"在编员工花名册":["11.0"],"detial":["11.0"],"1643950177973055490":["11.0"],"非在编员工花名册":["11.0"],"extra":["11.0"],"1547388316984360962":["11.0"],"权限配置":["11.0"],"configure":["11.0"],"1536370677184262146":["11.0"],"电子档案管理":["11.0"],"archives":["11.0"],"1536526560887369729":["11.0"],"证书管理":["11.0"],"certificate":["11.0"],"1640320899730595842":["11.0"],"考勤数据管理":["11.0"],"checking":["11.0"],"in":["11.0"],"1536526647864651777":["11.0"],"合同管理":["11.0"],"contract":["11.0"],"1536527705567457281":["11.0"],"招聘管理":["11.0"],"employ":["11.0"],"interview":["11.0"],"1536529235804745730":["11.0"],"招聘需求管理":["11.0"],"1536529334672879617":["11.0"],"简历库":["11.0"],"resume":["11.0"],"xitongguanli":["11.0"],"1536529411072126977":["11.0"],"面试管理":["11.0"],"management":["11.0"],"weibiaoti46":["11.0"],"1536529834893963266":["11.0"],"试用期管理":["11.0"],"probation":["11.0"],"系统监控":["11.0"],"msnui":["11.0"],"supervise":["11.0"],"服务监控":["11.0"],"http":["11.0"],"server":["11.0"],"流量监控":["11.0"],"liuliang":["11.0"],"缓存监控":["11.0"],"monitor":["11.0"],"redis":["11.0"],"qingchuhuancun":["11.0"],"接口文档":["11.0"],"swagger":["11.0"],"ui":["11.0"],"html":["11.0"],"wendang":["11.0"],"文档扩展":["11.0"],"doc":["11.0"],"事务监控":["11.0"],"tx":["11.0"],"gtsquanjushiwufuwugts":["11.0"],"在线事务":["11.0"],"model":["11.0"],"online":["11.0"],"quartz日志":["11.0"],"1536278268509220865":["11.0"],"薪酬管理":["11.0"],"salary":["11.0"],"anniu":["11.0"],"weixincaidanlianjie":["11.0"],"1536278751923728385":["11.0"],"薪酬制度":["11.0"],"weixincaidan":["11.0"],"1536531107336744962":["11.0"],"薪酬方案":["11.0"],"programme":["11.0"],"1536533575441379330":["11.0"],"薪酬项目":["11.0"],"project":["11.0"],"1536533421594308609":["11.0"],"tostring":["11.1"],"如果在":["11.1","11.2"],"保留当前节点":["11.1"],"并继续遍历它的子节点":["11.1"],"array":["11.1"],"isarray":["11.1"],"children":["11.1"],"递归调用":["11.1"],"直到没有children子节点":["11.1"],"如果不在":["11.1"],"检查它的子节点是否有被checkkeys数组包含的项":["11.1"],"id":["11.2"],"就把节点复制一份":["11.2"],"加入结果数组":["11.2"],"copy":["11.2"],"push":["11.2"]},{"2":["0.7"],"4":["0.1"],"7":["0.15"],"200":["0.7"],"2000":["0.35"],"3000":["0.35"],"3j":["0.1"],"以j结尾表示复数":["0.1"],"表达现实生活中的逻辑":["0.1"],"即真和假":["0.1"],"true表示真":["0.1"],"false表示假":["0.1"],"true本质上是一个数字记作1":["0.1"],"false记作0":["0.1"],"不能被执行":["0.2"],"只是对程序代码进行解释说明":["0.2"],"简单的说":["0.3"],"将x转换为一个整数":["0.5"],"float":["0.5"],"内容限定":["0.6"],"除":["0.7"],"除法赋值运算符":["0.8"],"d":["0.10"],"将内容转换成整数":["0.10"],"在程序中":["0.14"],"判断运算符左侧内容是否大于右侧满足为true":["0.15"],"if":["0.16"],"语句":["0.17"],"else语句":["0.18"],"你猜测的数字大了":["0.19"],"你猜测的数字小了":["0.19"],"条件需提供布尔类型结果":["0.21"],"临时变量":["0.23"],"j":["0.24"],"暂时跳过某次循环":["0.25"],"组织好的":["0.27"],"函数的调用":["0.28"],"空的":["0.30"],"无意义的":["0.30"],"get":["0.31"],"您取款":["0.31"],"元成功":["0.31"],"log":["0.35","0.37"],"功能":["0.39"],"init":["0.39"],"构造方法":["0.39"],"是比较下面两张":["0.40"],"20230507112827224":["0.41"],"20230507112938436":["0.42"],"使用不同的对象会得到不同的状态":["0.44"],"20230507114025295":["0.45"],"4399西普大陆官网":["5.0"],"然后再代码里获取这些标签资源":["5.1"],"children":["8.0","11.2"],"它处理":["8.1"],"render":["8.1"],"函数返回的":["8.1"],"参数":["8.1"],"一般来说":["8.1"],"second":["8.2"],"createtextvnode":["8.3","8.4"],"default":["8.3"],"key":["8.3"],"的一维数组":["8.4"],"它是这样的":["8.4"],"ts":["8.4"],"res":["8.4"],"算薪数据维护":["11.0"],"maintain":["11.0"],"1536533782530945026":["11.0"],"薪酬算发":["11.0"],"calc":["11.0"],"1536533888231600130":["11.0"],"薪酬核算":["11.0"],"check":["11.0"],"1640321535838740481":["11.0"],"导入考勤":["11.0"],"1544605206007263233":["11.0"],"新建工资表":["11.0"],"payroll":["11.0"],"1640321668282277890":["11.0"],"导入专项扣除":["11.0"],"1544605743922556930":["11.0"],"批量操作":["11.0"],"1544606292210364417":["11.0"],"批量编辑":["11.0"],"batch":["11.0"],"edid":["11.0"],"1544894348891729922":["11.0"],"导入社保明细表":["11.0"],"import":["11.0"],"security":["11.0"],"1544894382622322689":["11.0"],"导入公积金明细表":["11.0"],"accumulation":["11.0"],"fund":["11.0"],"1544894419519614977":["11.0"],"导入个税明细表":["11.0"],"tax":["11.0"],"1544894461080973313":["11.0"],"导出工资表":["11.0"],"1544606011980525570":["11.0"],"个税计算":["11.0"],"calculation":["11.0"],"1544892244311617538":["11.0"],"发送工资单":["11.0"],"send":["11.0"],"1544892322841571330":["11.0"],"发薪审批":["11.0"],"approval":["11.0"],"1544892407918833666":["11.0"],"工资发放通知":["11.0"],"notice":["11.0"],"1544894033215827969":["11.0"],"添加人员":["11.0"],"1544894150245298178":["11.0"],"导入临时员工":["11.0"],"temp":["11.0"],"employees":["11.0"],"1544894246605238273":["11.0"],"添加离职员工":["11.0"],"departing":["11.0"],"1536533972205760514":["11.0"],"社保公积金导入":["11.0"],"1552930619246399489":["11.0"],"页面":["11.0"],"1551824575071977474":["11.0"],"导入":["11.0"],"1536534102195630082":["11.0"],"verify":["11.0"],"1536534299562799105":["11.0"],"工资单发放记录":["11.0"],"record":["11.0"],"1536534369897082881":["11.0"],"算薪人员管理":["11.0"],"1536534871292571650":["11.0"],"调薪管理":["11.0"],"1536534949474398209":["11.0"],"1536535080831610882":["11.0"],"薪酬核算数据提报":["11.0"],"submit":["11.0"],"1536535161655848962":["11.0"],"流程配置":["11.0"],"huifu":["11.0"],"const":["11.1"],"hascheckedchild":["11.1"],"some":["11.1"],"child":["11.1"],"如果节点有children属性":["11.2"],"就递归调用过滤函数":["11.2"],"对其子节点进行过滤":["11.2"],"并赋值给复制的节点":["11.2"]},{"0":["8.4","11.2"],"2":["0.6","0.27","0.30"],"3":["8.4"],"4":["0.7"],"9":["0.7"],"18":["0.16"],"2000":["0.37"],"4000":["11.0"],"4100":["11.0"],"4101":["11.0"],"4200":["11.0"],"4201":["11.0"],"4300":["11.0"],"4301":["11.0"],"4302":["11.0"],"4303":["11.0"],"4400":["11.0"],"4401":["11.0"],"字符串":["0.1"],"string":["0.1"],"描述文本的一种数据类型":["0.1"],"由任意数量的字符组成":["0.1"],"列表":["0.1"],"list":["0.1","11.0"],"有序的可变序列":["0.1"],"python中使用最频繁的数据类型":["0.1"],"可有序记录一堆数据":["0.1"],"元组":["0.1"],"tuple":["0.1"],"有序的不可变序列":["0.1"],"让别人可以看懂程序代码的作用":["0.2"],"能够":["0.2"],"变量就是在程序运行时":["0.3"],"记录数据用的":["0.3"],"将x转换为一个浮点数":["0.5"],"取整除":["0.7"],"返回商的整数部分":["0.7"],"取模赋值运算符":["0.8"],"f":["0.10","0.22"],"进行逻辑判断也是最为基础的功能":["0.14"],"判断运算符左侧内容是否小于右侧满足为true":["0.15"],"age":["0.16"],"image":["0.17","0.18","0.44"],"第二次输入要猜测的数字":["0.19"],"true继续":["0.21"],"false停止":["0.21"],"内层循环print不要换行":["0.22"],"print":["0.22"],"in":["0.23"],"直接进行下一次":["0.25"],"使用函数的好处是":["0.27"],"函数如何返回none":["0.30"],"不使用return语句即返回none":["0.30"],"main":["0.31"],"主菜单":["0.31"],"欢迎来到anti花旗银行":["0.31"],"请选择操作":["0.31"],"输入1":["0.31"],"t":["0.31"],"输入2":["0.31"],"创建对象":["0.33"],"填写表格":["0.33"],"ring":["0.37"],"import":["0.37"],"winsound":["0.37"],"beep":["0.37"],"20230507112130556":["0.38"],"可用于创建类对象的时候设置初始化行为":["0.39"],"str":["0.39"],"用于实现类对象转字符串的行为":["0.39"],"20230507112830676这是不行的我们要用以下方法":["0.41"],"20230507114028254":["0.45"],"20230507064210127":["5.1"],"最终成品":["5.1"],"参数是一个一维数组":["8.0"],"都是":["8.1"],"vnode":["8.1"],"类型":["8.1"],"但是有一个特殊情况":["8.1"],"就是函数式组件":["8.1"],"functional":["8.1"],"component":["8.1"],"会返回一个数组而不是一个根节点":["8.1"],"这时候":["8.1"],"also":["8.2"],"这样的数组很难处理":["8.2"],"所以":["8.2"],"vue":["8.2"],"会调用":["8.2"],"simplenormalizechildren":["8.2"],"函数":["8.2"],"把它展平成一维数组":["8.2"],"likely":["8.3"],"generated":["8.3"],"by":["8.3"],"v":["8.3"],"tag":["8.3"],"vlist":["8.3","8.4"],"key":["8.4"],"1536535220334161921":["11.0"],"流程审批":["11.0"],"1545216059933941762":["11.0"],"流程列表":["11.0"],"1536535525318782977":["11.0"],"数据统计":["11.0"],"datastatistics":["11.0"],"1536535589516800002":["11.0"],"薪酬报表":["11.0"],"reportform":["11.0"],"xiaoxiguanli":["11.0"],"协同管理":["11.0"],"activti":["11.0"],"kuaisugongzuoliu":["11.0"],"o":["11.0"],"模型管理":["11.0"],"activiti":["11.0"],"weibiaoti13":["11.0"],"act":["11.0"],"流程管理":["11.0"],"process":["11.0"],"liucheng":["11.0"],"请假管理":["11.0"],"leave":["11.0"],"qingjia":["11.0"],"请假新增":["11.0"],"leavebill":["11.0"],"请假修改":["11.0"],"请假删除":["11.0"],"待办任务":["11.0"],"task":["11.0"],"renwu":["11.0"],"1549235371106263042":["11.0"],"绩效管理":["11.0"],"achievements":["11.0"],"1549235452740001794":["11.0"],"绩效填写":["11.0"],"write":["11.0"],"1549240860351291393":["11.0"],"审核大厅":["11.0"],"hall":["11.0"],"1549285378610061313":["11.0"],"绩效评定":["11.0"],"evaluate":["11.0"],"1555370010098221058":["11.0"],"自评":["11.0"],"assessment":["11.0"],"1555374275218849793":["11.0"],"上级评定":["11.0"],"leaderevaluate":["11.0"],"1555374334249484289":["11.0"],"中心负责人审核":["11.0"],"dutyevaluate":["11.0"],"1549294138573348865":["11.0"],"评定结果":["11.0"],"result":["11.0"],"1562023603390840833":["11.0"],"1562023762120081409":["11.0"],"比例展示":["11.0"],"1563090485890134018":["11.0"],"导出":["11.0"],"1563090793416503298":["11.0"],"导出明细表":["11.0"],"1563090833983811586":["11.0"],"导出汇总表":["11.0"],"1549294230478938113":["11.0"],"绩效核算":["11.0"],"如果有":["11.1"],"如果没有":["11.1"],"检查子节点的子节点是否有被checkkeys数组包含的项":["11.1"],"hascheckedchildchild":["11.1"],"else":["11.2"],"length":["11.2"],"如果不在":["11.2"]},{"0":["0.7"],"1":["8.1","8.4"],"2":["8.1"],"3":["0.6","0.30","8.1"],"4":["8.1"],"998":["11.0"],"999":["11.0"],"3000":["0.37"],"6000":["11.0"],"6100":["11.0"],"6101":["11.0"],"6102":["11.0"],"6103":["11.0"],"6200":["11.0"],"6201":["11.0"],"6202":["11.0"],"6203":["11.0"],"6204":["11.0"],"6300":["11.0"],"6301":["11.0"],"6302":["11.0"],"6303":["11.0"],"6400":["11.0"],"6401":["11.0"],"6402":["11.0"],"6403":["11.0"],"6500":["11.0"],"6700":["11.0"],"可有序记录一堆不可变的python数据集合":["0.1"],"集合":["0.1"],"set":["0.1"],"无序不重复集合":["0.1"],"可无序记录一堆不重复的python数据集合":["0.1"],"字典":["0.1"],"dictionary":["0.1"],"无序key":["0.1"],"value集合":["0.1"],"可无序记录一堆key":["0.1"],"value型的python数据集合":["0.1"],"大大增强程序的可读性":["0.2"],"image":["0.3"],"str":["0.5"],"大小写敏感":["0.6"],"幂赋值运算符":["0.8"],"将内容转换成浮点型":["0.10"],"判断运算符左侧内容是否大于等于右侧满足为true":["0.15"],"print":["0.16","0.24","0.35","0.37"],"20230507084757597":["0.17"],"20230507084822720":["0.18"],"第二次就猜中了":["0.19"],"请规划好循环终止条件":["0.21"],"t":["0.22"],"待处理数据集":["0.23"],"f":["0.24","0.35","0.37"],"提前退出循环":["0.25"],"将功能封装在函数内":["0.27"],"可供随时随地重复利用":["0.27"],"20230507103005192":["0.28"],"主动return":["0.30"],"none":["0.30"],"取款":["0.31"],"输入3":["0.31"],"退出":["0.31"],"输入4":["0.31"],"return":["0.31","8.3","11.1"],"请输入您的选择":["0.31"],"while":["0.31"],"true":["0.31"],"keyboard":["0.31"],"对象属性赋值":["0.33"],"闹钟id":["0.35","0.37"],"价格":["0.35"],"用于2个类对象进行小于或大于比较":["0.39"],"20230507112628093":["0.40"],"20230507112950495":["0.42"],"20230507113915580":["0.44"],"使用":["0.45"],"同样制冷的行为":["0.45"],"20230507064256726":["5.1"],"而不是一个多维数组":["8.0"],"函数就会把这个数组展平":["8.1"],"保证它只有一层深度":["8.1"],"比如这样":["8.2"],"这是整个函数的主要代码":["8.3"],"它使用一个":["8.3"],"循环遍历":["8.3"],"数组中的每个元素":["8.3"],"首先判断":["8.3"],"是否为":["8.3"],"或者布尔类型":["8.3"],"如果是":["8.3"],"就直接跳过当前循环":["8.3"],"然后声明并赋值":["8.3"],"变量为结果数组":["8.3"],"中的最后一个元素":["8.3"],"如果":["8.3"],"1557213241220333569":["11.0"],"绩效核算全部页":["11.0"],"all":["11.0"],"1557213108109901826":["11.0"],"绩效核算个人页":["11.0"],"personal":["11.0"],"1556575098926817282":["11.0"],"人员填报情况":["11.0"],"writesituation":["11.0"],"1549294369687887874":["11.0"],"人员配置":["11.0"],"config":["11.0"],"1621416056041189378":["11.0"],"系统配置":["11.0"],"1621417434813771777":["11.0"],"模板配置":["11.0"],"template":["11.0"],"1621417996418494465":["11.0"],"评分比例配置":["11.0"],"grade":["11.0"],"ratio":["11.0"],"1641259108840501249":["11.0"],"流程回退":["11.0"],"fallback":["11.0"],"微信管理":["11.0"],"mp":["11.0"],"gongzhonghao":["11.0"],"菜单设置":["11.0"],"wx":["11.0"],"保存":["11.0"],"wxmenu":["11.0"],"发布":["11.0"],"push":["11.0"],"删除":["11.0"],"运营数据":["11.0"],"statistics":["11.0"],"zhexiantu":["11.0"],"粉丝管理":["11.0"],"account":["11.0"],"fans":["11.0"],"fensiguanli":["11.0"],"粉丝新增":["11.0"],"wxaccountfans":["11.0"],"粉丝修改":["11.0"],"粉丝删除":["11.0"],"粉丝同步":["11.0"],"sync":["11.0"],"消息管理":["11.0"],"msg":["11.0"],"消息新增":["11.0"],"wxmsg":["11.0"],"消息修改":["11.0"],"消息删除":["11.0"],"账号管理":["11.0"],"公众号新增":["11.0"],"wxaccount":["11.0"],"公众号修改":["11.0"],"公众号删除":["11.0"],"自动回复":["11.0"],"auto":["11.0"],"reply":["11.0"],"childchild":["11.1"],"就判断节点是否有children属性":["11.2"],"如果有":["11.2"]},{"1":["0.31","11.1"],"2":["0.31"],"5":["8.1"],"5000":["11.0"],"5100":["11.0"],"5110":["11.0"],"5120":["11.0"],"5130":["11.0"],"5200":["11.0"],"5300":["11.0"],"5310":["11.0"],"5320":["11.0"],"5330":["11.0"],"5400":["11.0"],"5410":["11.0"],"5420":["11.0"],"5430":["11.0"],"5500":["11.0"],"5510":["11.0"],"5520":["11.0"],"6600":["11.0"],"6601":["11.0"],"6602":["11.0"],"6701":["11.0"],"6702":["11.0"],"6703":["11.0"],"6800":["11.0"],"6801":["11.0"],"6802":["11.0"],"6803":["11.0"],"6804":["11.0"],"代码中":["0.1"],"被写在代码中的固定的值":["0.1"],"常见的字面量类型":["0.1"],"我们目前了解":["0.1"],"字符串这三类即可":["0.1"],"如何基于print语句完成各类字面量的输出":["0.1"],"print":["0.1"],"单行注释":["0.2"],"以及多行注释":["0.2"],"20230507083216506":["0.3"],"将对象":["0.5"],"不可使用关键字":["0.6"],"取余":["0.7"],"返回除法的余数":["0.7"],"指数":["0.7"],"取整除赋值运算符":["0.8"],"image":["0.10","0.33"],"20230507083815608":["0.10"],"判断运算符左侧内容是否小于等于右侧满足为true":["0.15"],"我已经成年了":["0.16"],"第三次输入要猜测的数字":["0.19"],"否则将无限循环":["0.21"],"end":["0.22"],"循环满足条件时执行的代码":["0.23"],"t":["0.24"],"不在继续":["0.25"],"提高代码的复用性":["0.27"],"减少重复代码":["0.27"],"使用场景":["0.30"],"函数返回值":["0.30"],"if判断":["0.30"],"continue":["0.31"],"elif":["0.31"],"int":["0.31"],"您想要存款多少钱":["0.31"],"请输入":["0.31"],"20230507110504902":["0.33"],"clock1":["0.35","0.37"],"价格":["0.37"],"le":["0.39"],"用于2个类对象进行小于等于或大于等于比较":["0.39"],"eq":["0.39"],"20230507112631852":["0.40"],"20230507112907982这是正确的":["0.41"],"20230507113920015":["0.44"],"传入不同的对象得到不同的结果":["0.45"],"行为":["0.45"],"20230507064136185":["5.1"],"是一个数组":["8.3"],"就递归调用":["8.3"],"函数并将其结果追加到":["8.3"],"中":["8.3"],"是一个基本类型":["8.3"],"就将其转换成一个":["8.3"],"对象并追加到":["8.3"],"是一个对象":["8.3"],"就直接追加到":["8.3"],"在处理":["8.3"],"时":["8.3"],"还会判断是否存在":["8.3"],"你可以看到":["8.4"],"函数做了以下几件事":["8.4"],"它忽略了":["8.4"],"和":["8.4"],"值":["8.4"],"它把字符串":["8.4"],"新增回复":["11.0"],"wxautoreply":["11.0"],"编辑回复":["11.0"],"删除回复":["11.0"],"标签管理":["11.0"],"tag":["11.0"],"新增标签":["11.0"],"编辑标签":["11.0"],"删除标签":["11.0"],"同步标签":["11.0"],"素材管理":["11.0"],"material":["11.0"],"sucaisads":["11.0"],"素材维护":["11.0"],"wxmaterial":["11.0"],"素材删除":["11.0"],"支付管理":["11.0"],"pay":["11.0"],"pay6zhifu":["11.0"],"收银台":["11.0"],"cd":["11.0"],"shouyintai":["11.0"],"渠道管理":["11.0"],"paychannel":["11.0"],"zhifuqudaoguanli":["11.0"],"编辑渠道":["11.0"],"删除渠道":["11.0"],"增加渠道":["11.0"],"商品订单":["11.0"],"goods":["11.0"],"dingdan":["11.0"],"商品订单新增":["11.0"],"generator":["11.0"],"paygoodsorder":["11.0"],"商品订单修改":["11.0"],"商品订单删除":["11.0"],"支付订单":["11.0"],"orders":["11.0"],"zhifu":["11.0"],"支付订单新增":["11.0"],"paytradeorder":["11.0"],"支付订单修改":["11.0"],"支付订单删除":["11.0"],"回调记录":["11.0"],"notify":["11.0"],"huitiao":["11.0"],"记录新增":["11.0"],"paynotifyrecord":["11.0"],"记录修改":["11.0"],"删除当前节点":["11.1"],"splice":["11.1"],"如果复制的节点有子节点":["11.2"],"就加入结果数组":["11.2"]},{"3":["0.31"],"20":["0.35","0.37"],"22":["11.0"],"55":["0.35","0.37"],"92":["11.0"],"233":["11.0"],"2233":["11.0"],"2300":["11.0"],"5006":["11.0"],"5530":["11.0"],"7000":["11.0"],"9000":["11.0"],"9001":["11.0"],"9002":["11.0"],"9003":["11.0"],"9004":["11.0"],"9005":["11.0"],"9006":["11.0"],"9095":["11.0"],"10000":["11.0"],"215432":["0.35","0.37"],"输出整数10":["0.1"],"输出浮点数13":["0.1"],"黑马程序员":["0.1"],"输出字符串":["0.1"],"转换为字符串":["0.5"],"为10的20次方":["0.7"],"100000000000000000000":["0.7"],"第三次就猜中了":["0.19"],"三次机会用完了没有猜中":["0.19"],"end":["0.24"],"提高开发效率":["0.27"],"变量定义":["0.30"],"您想要取款多少钱":["0.31"],"else":["0.31"],"程序退出拉":["0.31"],"break":["0.31"],"用于2个类对象进行相等比较":["0.39"],"20230507114050737":["0.45"],"20230507064221983":["5.1"],"属性":["8.3"],"是一个包含文本内容的节点":["8.3"],"并且":["8.3"],"也是一个包含文本内容的节点":["8.3"],"就将这两个节点合并成一个节点":["8.3"],"是一个包含子节点的节点":["8.3"],"这里默认会为它生成一个默认的":["8.3"],"以便后续的虚拟":["8.3"],"dom":["8.3"],"渲染优化":["8.3"],"最后":["8.3"],"将处理后的结果数组":["8.3"],"返回":["8.3"],"转化为文本":["8.4"],"它把嵌套的数组展平":["8.4"],"并给每个":["8.4"],"添加了一个":["8.4"],"它保留了其他的":["8.4"],"记录删除":["11.0"],"开发平台":["11.0"],"gen":["11.0"],"shejiyukaifa":["11.0"],"数据源管理":["11.0"],"datasource":["11.0"],"mysql":["11.0"],"代码生成":["11.0"],"表单设计":["11.0"],"design":["11.0"],"biaodanbiaoqian":["11.0"],"表单管理":["11.0"],"form":["11.0"],"表单新增":["11.0"],"表单修改":["11.0"],"表单删除":["11.0"],"报表设计":["11.0"],"ureport":["11.0"],"designer":["11.0"],"p":["11.0"],"mrpbaobiao":["11.0"],"大屏设计":["11.0"],"shuju":["11.0"],"1519617202080763905":["11.0"],"流程实例":["11.0"],"workflow":["11.0"],"formallinstance":["11.0"],"1519856542551691266":["11.0"],"任务管理":["11.0"],"1519858240544362498":["11.0"],"历史任务":["11.0"],"taskmanager":["11.0"],"formmyhistorytask":["11.0"],"1519857720639410177":["11.0"],"已办任务":["11.0"],"formmyapprovedtask":["11.0"],"1519856947654348801":["11.0"],"代办任务":["11.0"],"formmytask":["11.0"],"1519240917571653633":["11.0"],"在线表单":["11.0"],"onlineform":["11.0"],"1519241257037647874":["11.0"],"formonlinepage":["11.0"],"1519241104306262017":["11.0"],"表单字典":["11.0"],"formonlinedict":["11.0"],"rizhiguanli":["11.0"],"1522026843028860929":["11.0"],"工单管理":["11.0"],"onlineforms":["11.0"],"1523555949679833090":["11.0"],"请假申请":["11.0"],"1523508311104688128":["11.0"],"1523555134041231360":["11.0"],"1522841153430929410":["11.0"],"测试请假工单":["11.0"],"1519587252497862658":["11.0"],"workflows":["11.0"],"1519587889809772545":["11.0"],"流程分类":["11.0"],"flowcategory":["11.0"],"formflowcategory":["11.0"],"1519610983479824385":["11.0"],"流程设计":["11.0"],"flowentry":["11.0"],"formflowentry":["11.0"],"1519617719855009793":["11.0"],"checkedkeys":["11.0"],"这两段初始代码用el":["11.0"],"tree渲染大概长这样":["11.0"],"image":["11.0"],"20230506154907843":["11.0"],"20230506154927007":["11.0"],"期望处理后的结果大概长这样":["11.0"],"20230506154952783":["11.0"],"返回过滤后的树形结构菜单":["11.1"],"解释一下else的逻辑":["11.1"],"el":["11.1"],"tree必须是全部子节点都选中才会选中父节点":["11.1"],"因此当只选中一部分时":["11.1"],"我们的checkedkeys里是不包含子节点的父节点的":["11.1"],"因此会走else部分":["11.1"],"当第一个children走完发现没有":["11.1"],"说明我们的tree是非常深的tree":["11.1"],"我们可能选了第3级的子节点而不包含父节点":["11.1"],"所以才会走hascheckedchildchild":["11.1"],"但这有个缺陷就是我们只能检查3层结构的tree":["11.1"],"当选择第4层时我们就无能为力了":["11.1"],"就跳过这个节点":["11.2"],"不加入结果数组":["11.2"],"continue":["11.2"],"返回结果数组":["11.2"],"return":["11.2"]}]'},n={"0.0":{t:"第一章基础语法",p:"\r",l:"base/py/index.html",a:"第一章基础语法"},"0.1":{t:"字面量",p:`学习目标:

1. 掌握字面量的含义
2. 了解常见字面量类型
3. 基于print语句完成各类字面量输出

字面量:　在代码中，被写下来的的固定的值，称之为字面量



类型
描述
说明




数 ...`,l:"base/py/index.html#字面量",a:"字面量"},"0.2":{t:"注释",p:`
注释：在程序代码中对程序代码进行解释说明的文字。
作用：注释不是程序，不能被执行，只是对程序代码进行解释说明，让别人可以看懂程序代码的作用，能够
大大增强程序的可读性。

单行注释# 以及多行注释  ...`,l:"base/py/index.html#注释",a:"注释"},"0.3":{t:"变量",p:`
变量：在程序运行时，能储存计算结果或能表示值的抽象概念。
简单的说，变量就是在程序运行时，记录数据用的

!image-20230507083216506
`,l:"base/py/index.html#变量",a:"变量"},"0.4":{t:"数据类型",p:`type(被查看类型的数据)
`,l:"base/py/index.html#数据类型",a:"数据类型"},"0.5":{t:"数据类型转换",p:`任何数据都可以转成字符串类型



语句**(函数)**
说明




int(x)
将x转换为一个整数


float(x)
将x转换为一个浮点数


str(x)
将对象 x 转换为字符串



`,l:"base/py/index.html#数据类型转换",a:"数据类型转换"},"0.6":{t:"标识符",p:`标识符命名规则
Python中，标识符命名的规则主要有3类：

内容限定
大小写敏感
不可使用关键字

`,l:"base/py/index.html#标识符",a:"标识符"},"0.7":{t:"运算符",p:`


运算符
描述
实例




+
加
两个对象相加 a + b 输出结果 30


-
减
得到负数或是一个数减去另一个数 a - b 输出结果 -10


*
乘
两个数相乘或是返回一个被重复若 ...`,l:"base/py/index.html#运算符",a:"运算符"},"0.8":{t:"复合运算符",p:`


运算符
描述
实例




+=
加法赋值运算符
c += a 等效于 c = c + a


-=
减法赋值运算符
c -= a 等效于 c = c - a


*=
乘法赋值运算符
c *= ...`,l:"base/py/index.html#复合运算符",a:"复合运算符"},"0.9":{t:"字符串扩展",p:"\r",l:"base/py/index.html#字符串扩展",a:"字符串扩展"},"0.10":{t:"字符串格式化",p:`


格式符号
转化




%s
将内容转换成字符串，放入占位位置


%d
将内容转换成整数，放入占位位置


%f
将内容转换成浮点型，放入占位位置



!image-202305070838 ...`,l:"base/py/index.html#字符串格式化",a:"字符串格式化"},"0.11":{t:"字符串简写格式化",p:`!image-20230507083908008
`,l:"base/py/index.html#字符串简写格式化",a:"字符串简写格式化"},"0.12":{t:"字符串精度控制",p:`!image-20230507083851981
`,l:"base/py/index.html#字符串精度控制",a:"字符串精度控制"},"0.13":{t:"第二章控制语句",p:"\r",l:"base/py/index.html#第二章控制语句",a:"第二章控制语句"},"0.14":{t:"判断语句",p:`
进行逻辑判断，是生活中常见的行为。同样，在程序中，进行逻辑判断也是最为基础的功能。

`,l:"base/py/index.html#判断语句",a:"判断语句"},"0.15":{t:"_1-布尔类型和比较运算符",p:`!image-20230507084238044
!image-20230507084312160



运算符
描述
示例




==
判断内容是否相等，满足为True，不满足为False
如a= ...`,l:"base/py/index.html#_1-布尔类型和比较运算符",a:"_1-布尔类型和比较运算符"},"0.16":{t:"_2-if语句的基本格式",p:`if age &gt;= 18:
	print(&quot;我已经成年了&quot;)

`,l:"base/py/index.html#_2-if语句的基本格式",a:"_2-if语句的基本格式"},"0.17":{t:"_3-if-else-语句",p:`!image-20230507084757597
`,l:"base/py/index.html#_3-if-else-语句",a:"_3-if-else-语句"},"0.18":{t:"_4-if-elif-else语句",p:`!image-20230507084822720
`,l:"base/py/index.html#_4-if-elif-else语句",a:"_4-if-elif-else语句"},"0.19":{t:"_5-判断语句的嵌套",p:`!image-20230507084933070
!image-20230507084940271
import random

num=random.randint(1,10)

guess_num ...`,l:"base/py/index.html#_5-判断语句的嵌套",a:"_5-判断语句的嵌套"},"0.20":{t:"第三章循环语句",p:`!image-20230507090741845
`,l:"base/py/index.html#第三章循环语句",a:"第三章循环语句"},"0.21":{t:"while循环的基础语法",p:`!image-20230507090909130
while循环的注意事项
条件需提供布尔类型结果，True继续，False停止
请规划好循环终止条件，否则将无限循环
`,l:"base/py/index.html#while循环的基础语法",a:"while循环的基础语法"},"0.22":{t:"while循环的嵌套",p:`!image-20230507091141354
i = 1

while i &lt;= 9:
    # 定义内层循环的控制变量
    j = 1
    while j &lt;= i:
   ...`,l:"base/py/index.html#while循环的嵌套",a:"while循环的嵌套"},"0.23":{t:"for循环的基础语法",p:`!image-20230507091337795
for 临时变量 in 待处理数据集: 
        循环满足条件时执行的代码

`,l:"base/py/index.html#for循环的基础语法",a:"for循环的基础语法"},"0.24":{t:"for循环的嵌套应用",p:`!image-20230507091622849

for i in range(1, 10):
    for j in range(1, i + 1):
        print(f&quot; ...`,l:"base/py/index.html#for循环的嵌套应用",a:"for循环的嵌套应用"},"0.25":{t:"循环中断-break和continue",p:`
在这个重复的过程中，会出现一些其它情况让我们不得不：
暂时跳过某次循环，直接进行下一次
提前退出循环，不在继续

`,l:"base/py/index.html#循环中断-break和continue",a:"循环中断-break和continue"},"0.26":{t:"第四章函数",p:"\r",l:"base/py/index.html#第四章函数",a:"第四章函数"},"0.27":{t:"函数介绍",p:`
函数：是组织好的，可重复使用的，用来实现特定功能的代码段。

1. 函数是：
	组织好的、可重复使用的、用来实现特定功能的代码段
2. 使用函数的好处是：
    将功能封装在函数内，可供随时随地重 ...`,l:"base/py/index.html#函数介绍",a:"函数介绍"},"0.28":{t:"函数的定义",p:`函数定义:
!image-20230507102929068
函数的调用：
!image-20230507103005192
`,l:"base/py/index.html#函数的定义",a:"函数的定义"},"0.29":{t:"函数的参数",p:`!image-20230507103237942
`,l:"base/py/index.html#函数的参数",a:"函数的参数"},"0.30":{t:"函数的返回值",p:`!image-20230507103417340函数默认返回None**
1. 什么是None
	None是类型’NoneType’的字面量，用于表示：空的、无意义的
2. 函数如何返回None
	不 ...`,l:"base/py/index.html#函数的返回值",a:"函数的返回值"},"0.31":{t:"变量的作用域",p:`
变量作用域指的是变量的作用范围（变量在哪里可用，在哪里不可用）

主要分为两类：局部变量和全局变量
# 定义一个全局变量money
money = 500000
# 定义一个全局变量name
nam ...`,l:"base/py/index.html#变量的作用域",a:"变量的作用域"},"0.32":{t:"第五章面向对象",p:"\r",l:"base/py/index.html#第五章面向对象",a:"第五章面向对象"},"0.33":{t:"初识对象",p:`
设计表格，称之为：设计类（class）
打印表格，称之为：创建对象
填写表格，称之为：对象属性赋值

!image-20230507110504902
`,l:"base/py/index.html#初识对象",a:"初识对象"},"0.34":{t:"成员方法",p:`!image-20230507110618318
`,l:"base/py/index.html#成员方法",a:"成员方法"},"0.35":{t:"类和对象",p:`!image-20230507111358788
!image-20230507111404993
class Clock:
    id = None
    price = None

    d ...`,l:"base/py/index.html#类和对象",a:"类和对象"},"0.36":{t:"类和对象的关系是什么",p:`
类是程序中的“设计图纸”
对象是基于图纸生产的具体实体

`,l:"base/py/index.html#类和对象的关系是什么",a:"类和对象的关系是什么"},"0.37":{t:"其它内置方法",p:`!image-20230507111610421
class Clock:
    id = None
    price = None

    def __init__(self, id, pri ...`,l:"base/py/index.html#其它内置方法",a:"其它内置方法"},"0.38":{t:"str",p:`期望把类对象转成字符串
!image-20230507112126667
!image-20230507112130556
`,l:"base/py/index.html#str",a:"str"},"0.39":{t:"lt",p:`期望比较两个类的某个属性的值
!image-20230507112303223
!image-20230507112308015



方法
功能




init
构造方法，可用于创建类对象的时候设 ...`,l:"base/py/index.html#lt",a:"lt"},"0.40":{t:"封装",p:`私有成员类对象是没办法直接使用的,是类内部的其它成员使用的
!image-20230507112604357
是比较下面两张
!image-20230507112628093
!image-20230 ...`,l:"base/py/index.html#封装",a:"封装"},"0.41":{t:"继承",p:`!image-20230507112805249
!image-20230507112827224
!image-20230507112830676这是不行的我们要用以下方法×
!image-2023 ...`,l:"base/py/index.html#继承",a:"继承"},"0.42":{t:"多继承",p:`谁先来的,谁的优先级要高
!image-20230507112938436
!image-20230507112950495
`,l:"base/py/index.html#多继承",a:"多继承"},"0.43":{t:"复写以及调用",p:`!image-20230507113439867
`,l:"base/py/index.html#复写以及调用",a:"复写以及调用"},"0.44":{t:"多态",p:`多态，指的是：多种状态，即完成某个行为时，使用不同的对象会得到不同的状态。
!image-20230507113915580
!image-20230507113920015
`,l:"base/py/index.html#多态",a:"多态"},"0.45":{t:"抽象类",p:`顶层上级
!image-20230507114009025
!image-20230507114021030
!image-20230507114025295
!image-2023050711402 ...`,l:"base/py/index.html#抽象类",a:"抽象类"},"3.0":{t:"ehr",p:`项目待整理,预计分版本记录,近请期待
`,l:"project/ehr/index.html",a:"ehr"},"4.0":{t:"飞机大战",p:`\r
\r`,l:"project/planwar/index.html",a:"飞机大战"},"4.1":{t:"面向对象",p:"",l:"project/planwar/index.html#面向对象",a:"面向对象"},"5.0":{t:"西普大陆",p:`西普大陆_西普大陆小游戏_西普大陆精灵大全-4399西普大陆官网
`,l:"project/xpdl/index.html",a:"西普大陆"},"5.1":{t:"七夕之约",p:`在flash里打一些标签(sprit)等
!image-20230507064012098
然后再代码里获取这些标签资源
!image-20230507064210127
最终成品
!image-20 ...`,l:"project/xpdl/index.html#七夕之约",a:"七夕之约"},"6.0":{t:"工作证明",p:"\r",l:"resume/index.html",a:"工作证明"},"6.1":{t:"_4399",p:`!20210929_092240
`,l:"resume/index.html#_4399",a:"_4399"},"6.2":{t:"国科",p:`!image-20230507073428517
`,l:"resume/index.html#国科",a:"国科"},"7.0":{t:"index",p:"",l:"source/vue/index.html",a:"index"},"8.0":{t:"归一化处理",p:`它的目的是保证 render 函数返回的 children 参数是一个一维数组，而不是一个多维数组
`,l:"source/vue/render/children.html",a:"归一化处理"},"8.1":{t:"simplenormalizechildren",p:`export function simpleNormalizeChildren(children: any) {
    for (let i = 0; i &lt; children.length; ...`,l:"source/vue/render/children.html#simplenormalizechildren",a:"simplenormalizechildren"},"8.2":{t:"更多例子",p:`const FunctionalComponent = {
    functional: true,
    render(h) {
        return [
            h(& ...`,l:"source/vue/render/children.html#更多例子",a:"更多例子"},"8.3":{t:"normalizearraychildren",p:`function normalizeArrayChildren(children: any, nestedIndex?: string): Array&lt;VNode&gt; {
    const ...`,l:"source/vue/render/children.html#normalizearraychildren",a:"normalizearraychildren"},"8.4":{t:"更多例子",p:`const children = [
    null,
    &quot;Hello&quot;,
    h(&quot;span&quot;, &quot;World&quot;),
     ...`,l:"source/vue/render/children.html#更多例子",a:"更多例子"},"9.0":{t:"render",p:"",l:"source/vue/render/index.html",a:"render"},"10.0":{t:"array",p:`对数组结构的处理包括 tree 等结构后续会补充
`,l:"utils/array/index.html",a:"array"},"11.0":{t:"树形结构",p:`如下数据结构,一个树形菜单一个选种后的所有checkedKeys,我们需要做的是根据选中的checkedKeys过滤掉没选中的
// 树形菜单
const treeData=[
    {
      ...`,l:"utils/array/tree/index.html",a:"树形结构"},"11.1":{t:"三层结构",p:`处理代码如下:
// 定义过滤函数
export function filterTreeByCheckKeys(tree, checkKeys) {
  // 判断checkKeys是否为空,不为空才 ...`,l:"utils/array/tree/index.html#三层结构",a:"三层结构"},"11.2":{t:"最终代码",p:`// 定义一个过滤函数，接受treeData和checkedKeys作为参数
        const filterTree = (treeData, checkedKeys) =&gt; {
   ...`,l:"utils/array/tree/index.html#最终代码",a:"最终代码"},"12.0":{t:"开发实践种的工具函数",p:`处理数据结构时用到的函数记录
​
`,l:"utils/index.html",a:"开发实践种的工具函数"}},a={previewLength:100,buttonLabel:"搜索",placeholder:"情输入关键词"},i={INDEX_DATA:e,PREVIEW_LOOKUP:n,Options:a};export{i as default};
